{"id": "pdpc_guidance_common_data_intermediary_v1#0", "doc_id": "pdpc_guidance_common_data_intermediary_v1", "section": "Front Matter & Context", "step": null, "headings": ["Front Matter & Context"], "text": "1 \n \n \n \nPRACTICAL GUIDANCE IN RELATION TO DATA COLLABORATION \nARRANGEMENT INVOLVING COMMON DATA INTERMEDIARY  \n1. The Personal Data Protection Commission (PDPC) received several requests for \nguidance on data collaboration arrangements involving a common data \nintermediary (“DI”) that processes personal data on behalf and for the purposes of \ngroups of data contributors (“DCs”). This document consolidates the PDPC’s \nguidance and provides additional clarification on various PDPA-related issues \nrelating to data collaboration arrangements.", "metadata": {"source": "UserUpload:Guidance to Data Collaboration Arrangement Involving Common Data Intermediary.pdf", "jurisdiction": "Singapore", "topic": "PDPC Practical Guidance: Data Collaboration with a Common Data Intermediary (DI)", "keywords": ["PDPA", "PDPC", "data collaboration", "data intermediary", "DI", "data contributors", "DCs", "tokenised NRIC", "consent", "exceptions", "derived data", "aggregated insights", "anonymisation", "re-identification risk", "marketing", "leads", "contracts", "accountability"], "semantic_scope": "major-section-consolidated", "hierarchy_path": ["PDPC Guidance — Common DI", "Front Matter & Context"]}}
{"id": "pdpc_guidance_common_data_intermediary_v1#1", "doc_id": "pdpc_guidance_common_data_intermediary_v1", "section": "Data Collaboration Model (Stages)", "step": null, "headings": ["Data Collaboration Model (Stages)"], "text": "Data Collaboration Model  \n \n2. In general, the guidance sought by the organisations relates to three broad stages \nin data collaboration models:  \n \na. Feasibility Testing Stage : Before undertaking data collaboration projects, \nthe DCs may wish to conduct feasibility tests utilising a common DI. This \nmay involve DCs disclosing tokenised NRIC numbers to the DI to determine \nif meaningful research can be performed. For example, the DI would \ncompare a list of tokenised NRIC numbers of individuals collected from the \nDCs and determine whether there is sufficient overlaps amongst the DCs to \nproceed with the projects. \n \nb. Data Processing Stage : The two main modes of data processing are: i) the \ncommon DI combines the raw personal data contributed by the DCs and \nperforms minimal or no further data processing. The resultant combined \ndataset is then shared with the DCs; or ii) the common DI creates derived \ndata and insights from the merged datasets contributed by the DCs. The \nderived data is then shared back with the DCs to be either used as a new \nattribute relating to an individual or in its aggregate form. \n \nc. Marketing Stage:  DCs plan to use the insights and models generated to \ninform their marketing strategies, and may include sharing leads with each \nother to test out these marketing strategies.", "metadata": {"source": "UserUpload:Guidance to Data Collaboration Arrangement Involving Common Data Intermediary.pdf", "jurisdiction": "Singapore", "topic": "PDPC Practical Guidance: Data Collaboration with a Common Data Intermediary (DI)", "keywords": ["PDPA", "PDPC", "data collaboration", "data intermediary", "DI", "data contributors", "DCs", "tokenised NRIC", "consent", "exceptions", "derived data", "aggregated insights", "anonymisation", "re-identification risk", "marketing", "leads", "contracts", "accountability"], "semantic_scope": "major-section-consolidated", "hierarchy_path": ["PDPC Guidance — Common DI", "Data Collaboration Model (Stages)"]}}
{"id": "pdpc_guidance_common_data_intermediary_v1#2", "doc_id": "pdpc_guidance_common_data_intermediary_v1", "section": "PDPC’s Guidance (Overview)", "step": null, "headings": ["PDPC’s Guidance (Overview)"], "text": "PDPC’s guidance", "metadata": {"source": "UserUpload:Guidance to Data Collaboration Arrangement Involving Common Data Intermediary.pdf", "jurisdiction": "Singapore", "topic": "PDPC Practical Guidance: Data Collaboration with a Common Data Intermediary (DI)", "keywords": ["PDPA", "PDPC", "data collaboration", "data intermediary", "DI", "data contributors", "DCs", "tokenised NRIC", "consent", "exceptions", "derived data", "aggregated insights", "anonymisation", "re-identification risk", "marketing", "leads", "contracts", "accountability"], "semantic_scope": "major-section-consolidated", "hierarchy_path": ["PDPC Guidance — Common DI", "PDPC’s Guidance (Overview)"]}}
{"id": "pdpc_guidance_common_data_intermediary_v1#3", "doc_id": "pdpc_guidance_common_data_intermediary_v1", "section": "Guidance — Feasibility Testing Stage", "step": null, "headings": ["Guidance — Feasibility Testing Stage"], "text": "Feasibility Testing stage \n3. The PDPC notes that feasibility tests usually involve the processing of tokenised \nNRIC numbers by the common DI on behalf of and for the purposes of the DCs \nand it will be conducted as a preparatory step to the eventual fusing and \n \n \n \n \n \n2 \n \n \nanonymisation of datasets , solely for the purpose of ascertaining the pool of \ncommon individuals amongst the datasets provided by the DCs. Tokenised NRIC \nnumbers are used as this is a convenient form of universal or common unique \nidentifier that is fairly accurate and unchanging. As tokenised NRIC numbers alone, \nwithout other information about an individual, are less likely to identify specific \nindividuals, the risk of identification of individuals is assessed to be low. As such, \nthey can be used in this preparatory step. Given this, consent is not required for \nthe data collaboration partners’ disclosure of tokenised NRIC numbers  to the \ncommon DI. Care should nevertheless be taken to adopt responsible practices in \nthe creation of tokens and when transmitting lists of tokens. For example, using a \nconfidential salt when creating the token, selecting an appropriate encryption or \nhashing algorithm, and password-protecting the lists of tokens during transmission.", "metadata": {"source": "UserUpload:Guidance to Data Collaboration Arrangement Involving Common Data Intermediary.pdf", "jurisdiction": "Singapore", "topic": "PDPC Practical Guidance: Data Collaboration with a Common Data Intermediary (DI)", "keywords": ["PDPA", "PDPC", "data collaboration", "data intermediary", "DI", "data contributors", "DCs", "tokenised NRIC", "consent", "exceptions", "derived data", "aggregated insights", "anonymisation", "re-identification risk", "marketing", "leads", "contracts", "accountability"], "semantic_scope": "major-section-consolidated", "hierarchy_path": ["PDPC Guidance — Common DI", "Guidance — Feasibility Testing Stage"]}}
{"id": "pdpc_guidance_common_data_intermediary_v1#4", "doc_id": "pdpc_guidance_common_data_intermediary_v1", "section": "Guidance — Data Processing Stage", "step": null, "headings": ["Guidance — Data Processing Stage"], "text": "Data Processing Stage \n4. PDPC would like to first clarify on the roles and responsibilities of DCs and DI in \ndata collaboration arrangements. Where an organisation with possession or \ncontrol of personal data – referred to as the DC – engages another organisation to \nprocess the datasets on its behalf and for its purposes, the organisation processing \ndata is considered a DI. Where a DI is involved in the anonymisation of personal \ndata, both DCs and DI have different roles to play in ensuring compliance with the \nPDPA Obligations.  \na. DCs are responsible for: \ni. Specifying to the DI its business requirements and management \ndecisions (including approving the technical and process measures \nthat the DI recommends) in relation to the outsourcing; \nii. Putting in place legal and process safeguards to ensure that DI is \nprotecting the data adequately when it is processing the data. \nb. DIs are responsible for: \ni. Making recommendations on the technical means of anonymising \nand/or fusing the data in order to achieve DCs’ requirements;  \nii. Making recommendations on technical and process measures to \nprotect data that it is processing on behalf of DCs, including \naddressing re-identification risks and securing data in transit; \niii. Implementing the technical, process and legal measures and \nsafeguards that have been approved by DCs. \n \n \n \n \n \n3 \n \n \n5. The DI should also ensure that it only processes the personal data for the DCs’ \npurposes in order to stay within the reduced set of obligations that DIs are subject \nto. In the event that the DI uses or discloses personal data in a manner that goes \nbeyond the processing required by the DCs (e.g., using or disclosing data obtained \nfrom the Data Contributors for other purposes), it will be required to comply with all \nData Protection Provisions under the PDPA. The DI should formally establish this \nrelationship and arrangements with the DCs, such as through a written contract or \nagreement. \n \n6. Under the mode outlined at paragraph 2(b)(i) above, the resultant dataset returned \nto the DCs is a combination of the raw personal data contributed by the DCs. As \nsuch, PDPC will consider the DCs to have direct access to the personal data \nprovided by the other DC in the merged dataset. Consequently, DCs will be \nconsidered to have either collected or disclosed personal data of their \nrespective customers1, for which either an exception to consent applies or \ncustomer consent is required . The same position will apply in relation to personal \ndata of non-customers that are shared by the DCs with the common DI. As the \ncommon DI is processing the personal data on behalf of and for the purposes of \nthe DCs, it can only do what the DCs themselves are permitted to do. In this case, \nthe common DI may merge the datasets without consent if the DCs are able to rely \non an applicable exception to consent to do so. However, if DCs are unable to rely \non an applicable exception, consent will be required and the common DI may only \nmerge the datasets if the DCs have obtained consent for that purpose. As the \nConsent Obligation under the PDPA is applicable only to DCs, the responsibility to \nassess the applicability of exceptions to consent lies with the DCs. DIs that process \ndata on behalf and for the purposes of the DCs will be entitled to accept and rely \non the representations and warranties from the DCs that either an exception is \napplicable or customer consent has been obtained. Nevertheless, the DI should, \nas part of performing due diligence, ensure that the question of applicable \nexception or customer consent is addressed as part of its discussion with the DCs. \n \n7. Modes of Processing. Under the mode outlined at paragraph 2(b)(ii) above, the \nderived data in the form of i) aggregated insights;  ii) attributes of customer user \nprofiles; or iii) attributes relating to an individual are generated based on personal \ndata contributed by the DCs. Each of the DCs has no direct access to the raw \npersonal data contributed by the other party, as the processing is done by the \ncommon DI. As these insights are derived by analysing or aggregating customers \nbased on business rules and drawing inferences relating to common features or \npreferences of either aggregated group2 (e.g. profile creation) or individual \n \n1 For example, additional attributes of common customer obtained from the dataset from the other DC. \n2 Aggregation is one of the techniques to anonymise personal data. Refer to PDPC’s Guide to Basic \nAnonymisation Techniques for more details. \n \n \n \n \n \n4 \n \n \ncustomers, the new or additional attributes cannot be used to recreate the personal \ndata contributed by each DC. As such, PDPC will consider DCs to have used \npersonal data of their own customers to derive aggregated insights or new \nattributes, for which separate consent is not required . However, this guidance \nis conditioned on implementing sufficient accountability measures to prevent one \nDC from gaining access to the raw personal data from the other DCs. The \naccountability measures should minimally include:  \n \na. Legal safeguards/agreement : A contractual agreement between the DCs and \ncommon DI, clearly specifying the common DI’s obligations and responsibilities \nin respect of its processing and generation of aggregated insights on behalf of \nand for the purposes of DCs. DCs should also ensure that the common DI does \nnot use or disclose the personal data in a manner that goes beyond the \nprocessing required by the DCs.  \n \nb. Assess and ensure that there is  low risk of DCs gaining access to raw \npersonal data contributed by the other DC :   \n \n(i) When sharing personal data between DC and DI : Technical and \nprocedural safeguards should be implemented to prevent re-identification \nof individuals. Examples of technical/procedural safeguards include \npseudonymisation, hashing of personal data such that no personal \nidentifiers will be shared in the clear; and/or having a clear separation of \nroles such as having separate teams within the common DI (e.g., one team \nthat defines the common salt and another team to fuse/merge the data). \n \n(ii) When common DI is processing personal data and generating \nderived insights : In cases where the processing is minimal and/or based \non simple and well-known mathematical calculations that could be easily \nreverse-engineered to obtain the original dataset, the resultant dataset \nmay not be considered as derived insights and the PDPC’s guidance at \npara 5 will apply.  \n \n(iii) When sharing derived data/insights between DI and DC : The customer \nprofiles to which the derived data/insights relate to should not be granular \nsuch that it enables DCs to deduce the original dataset contributed by \nother DCs. For instance, derived insights or specific attributes about a \ncustomer profile consisting of a larger pool of individuals will likely be \nconsidered to be aggregated insights and it is less likely that DCs will be \nable to deduce the raw personal data contributed by the other DC.  \n \n \n \n \n \n \n5 \n \n \n8. In addition to the above accountability measures, DCs should also take the \nfollowing measures when considering data collaboration arrangements: \n \na. Assess and ensure that the purpose of using the derived insights is \nreasonable:  DCs should determine the actions and decisions they are planning \nto make with the derived data/insights that is shared by the common DI (e.g., \nmatching derived data against CRM for marketing purposes), and the risks of \nimpact to individuals if they carry out such actions and decisions. The purpose \nwill be considered reasonable if it is what a reasonable person would consider \nappropriate in the circumstances.  \n \nb. Ensure accuracy of personal data : DCs should put in place measures and \nprocesses to ensure that the raw personal data shared with the common DI is \nmaterially accurate before further processing takes place. Where the \naggregated or derived data being shared with the DCs are based on pre-agreed \ncategories and profiles of individuals (determined by DC), DIs should ensure \nthat the selection criteria are applied accurately when labelling or assigning \nspecific individuals to each category/profile.", "metadata": {"source": "UserUpload:Guidance to Data Collaboration Arrangement Involving Common Data Intermediary.pdf", "jurisdiction": "Singapore", "topic": "PDPC Practical Guidance: Data Collaboration with a Common Data Intermediary (DI)", "keywords": ["PDPA", "PDPC", "data collaboration", "data intermediary", "DI", "data contributors", "DCs", "tokenised NRIC", "consent", "exceptions", "derived data", "aggregated insights", "anonymisation", "re-identification risk", "marketing", "leads", "contracts", "accountability"], "semantic_scope": "major-section-consolidated", "hierarchy_path": ["PDPC Guidance — Common DI", "Guidance — Data Processing Stage"]}}
{"id": "pdpc_guidance_common_data_intermediary_v1#5", "doc_id": "pdpc_guidance_common_data_intermediary_v1", "section": "Guidance — Marketing Stage", "step": null, "headings": ["Guidance — Marketing Stage"], "text": "Marketing Stage \n \n9. After generating insights as described at paragraph 2(c), DCs may want to share \nwith each other contact information of individuals identified as leads so that they \nmay seek consent from the individuals for direct marketing purposes. In this \nsituation, as the DCs will share personal data (i.e., contact information of \nindividuals) with each other, DCs will be considered to have collected (or disclosed) \npersonal data, and consent will be required, unless any exception applies.", "metadata": {"source": "UserUpload:Guidance to Data Collaboration Arrangement Involving Common Data Intermediary.pdf", "jurisdiction": "Singapore", "topic": "PDPC Practical Guidance: Data Collaboration with a Common Data Intermediary (DI)", "keywords": ["PDPA", "PDPC", "data collaboration", "data intermediary", "DI", "data contributors", "DCs", "tokenised NRIC", "consent", "exceptions", "derived data", "aggregated insights", "anonymisation", "re-identification risk", "marketing", "leads", "contracts", "accountability"], "semantic_scope": "major-section-consolidated", "hierarchy_path": ["PDPC Guidance — Common DI", "Guidance — Marketing Stage"]}}
